app/controllers/users_controller.rb

SELECT 1 FROM "users" WHERE LOWER("users"."email") = LOWER('ianba') LIMIT 1
---
  def create
    user = User.find_by_email(params[:session][:email])